# Ryan's Brewfile -- run: brew bundle --file=Brewfile
# Generated 2026-01-30

# Taps
tap "gromgit/fuse"
tap "hashicorp/tap"
tap "homebrew/services"
tap "keith/formulae"
tap "koekeishiya/formulae"
tap "microsoft/mssql-release"
tap "ngrok/ngrok"
tap "popcorn-official/popcorn-desktop"
tap "steipete/tap"
tap "supabase/tap"
tap "tw93/tap"
tap "withgraphite/tap"

# Core dev tools
brew "git"
brew "git-lfs"
brew "gh"
brew "jj"
brew "graphite"
brew "just"
brew "lefthook"
brew "pre-commit"
brew "ripgrep"
brew "shellcheck"
brew "jq"
brew "curl"
brew "wget"
brew "tree"
brew "htop"
brew "ncdu"
brew "ranger"
brew "coreutils"
brew "ast-grep"

# Languages & runtimes
brew "deno"
brew "go"
brew "node"
brew "openjdk"
brew "openjdk@21"
brew "python@3.12"
brew "python@3.13"
brew "python@3.14"
brew "llvm@20"

# Package managers
brew "pnpm"
brew "pipx"
brew "poetry"
brew "uv"
brew "maven"

# Infrastructure & cloud
brew "awscli"
brew "azure-cli"
brew "terraform"
brew "packer"
brew "supabase"
brew "act"
brew "actionlint"
brew "docker"
brew "nmap"
brew "openconnect"
brew "rclone"

# Databases
brew "postgresql@16"
brew "dbmate"
brew "libpq"

# AI / ML
brew "openai-whisper"
brew "pytorch"
brew "gemini-cli"

# Media
brew "ffmpeg"
brew "imagemagick"
brew "tesseract"
brew "pandoc"

# Window management
brew "yabai"
brew "skhd"

# Security & analysis
brew "semgrep"
brew "trivy"

# API tools
brew "swagger-codegen"
brew "openapi-generator"

# Other CLI tools
brew "himalaya"
brew "signal-cli"
brew "mole"
brew "gawk"
brew "sqlite"
brew "yamllint"

# Casks (GUI apps)
cask "anaconda"
cask "basictex"
cask "cursor"
cask "docker-desktop"
cask "fuse"
cask "ghostty"
cask "hammerspoon"
cask "iterm2"
cask "karabiner-elements"
cask "macfuse"
cask "ngrok"
cask "orbstack"
cask "spaceid"
cask "spotify"
cask "upscayl"
cask "vlc"
