# Ryan's Brewfile -- run: brew bundle --file=Brewfile
# Generated 2026-02-08

# Taps
tap "gromgit/fuse"
tap "hashicorp/tap"
tap "homebrew/services"
tap "keith/formulae"
tap "koekeishiya/formulae"
tap "microsoft/mssql-release"
tap "ngrok/ngrok"
tap "popcorn-official/popcorn-desktop"
tap "sheeki03/tap"
tap "steipete/tap"
tap "supabase/tap"
tap "tw93/tap"
tap "withgraphite/tap"

# Core dev tools
brew "git"
brew "git-lfs"
brew "gh"
brew "jj"
brew "graphite"
brew "just"
brew "lefthook"
brew "pre-commit"
brew "ripgrep"
brew "shellcheck"
brew "jq"
brew "curl"
brew "wget"
brew "tree"
brew "htop"
brew "ncdu"
brew "ranger"
brew "coreutils"
brew "ast-grep"
brew "emacs"

# Languages & runtimes
brew "deno"
brew "go"
brew "node"
brew "openjdk"
brew "openjdk@21"
brew "python@3.10"
brew "python@3.11"
brew "python@3.12"
brew "python@3.13"
brew "python@3.14"
brew "llvm@20"

# Package managers
brew "pnpm"
brew "pipx"
brew "poetry"
brew "uv"
brew "maven"
brew "mas"

# Infrastructure & cloud
brew "awscli"
brew "azure-cli"
brew "terraform"
brew "packer"
brew "supabase"
brew "act"
brew "actionlint"
brew "docker"
brew "nmap"
brew "openconnect"
brew "rclone"
brew "tirith"

# Databases
brew "postgresql@16"
brew "dbmate"
brew "libpq"
brew "unixodbc"
brew "msodbcsql18"
brew "mssql-tools18"

# AI / ML
brew "openai-whisper"
brew "pytorch"
brew "gemini-cli"
brew "bird"
brew "peekaboo"
brew "sag"
brew "summarize"

# Media
brew "ffmpeg"
brew "imagemagick"
brew "tesseract"
brew "pandoc"
brew "pillow"
brew "weasyprint"

# Window management
brew "yabai"
brew "skhd"
brew "dockutil"

# Security & analysis
brew "semgrep"
brew "trivy"
brew "gnupg"

# API tools
brew "swagger-codegen"
brew "openapi-generator"

# Apple/iOS tools
brew "remindctl"
brew "reminders-cli"
brew "ideviceinstaller"
brew "ifuse-mac"

# Other CLI tools
brew "himalaya"
brew "signal-cli"
brew "mole"
brew "gawk"
brew "sqlite"
brew "yamllint"
brew "flock"
brew "qrencode"
brew "prek"
brew "gogcli"

# Casks (GUI apps) -- dev tools
cask "anaconda"
cask "basictex"
cask "cursor"
cask "visual-studio-code"
cask "docker-desktop"
cask "ghostty"
cask "iterm2"
cask "orbstack"
cask "ngrok"

# Casks -- system & window management
cask "hammerspoon"
cask "karabiner-elements"
cask "rectangle"
cask "spaceid"
cask "alfred"
cask "cleanshot"
cask "flux"
cask "meetingbar"

# Casks -- filesystems & storage
cask "fuse"
cask "macfuse"
cask "cryptomator"
cask "dropbox"
cask "onedrive"

# Casks -- browsers
cask "arc"
cask "google-chrome"

# Casks -- communication
cask "slack"
cask "discord"
cask "signal"
cask "whatsapp"
cask "zoom"

# Casks -- productivity
cask "notion"
cask "superhuman"
cask "linear-linear"
cask "anki"
cask "dynalist"

# Casks -- AI
cask "chatgpt"
cask "claude"
cask "ollama"

# Casks -- media
cask "spotify"
cask "vlc"
cask "upscayl"
cask "transmission"

# Casks -- security & VPN
cask "1password"
cask "bitwarden"
cask "tailscale"
cask "private-internet-access"

# Casks -- virtualization
cask "parallels"

# Casks -- misc
cask "steam"
cask "rewind"
cask "coscreen"
cask "wispr-flow"

# Casks -- work/enterprise (uncomment if needed)
# cask "okta-verify"
# cask "citrix-workspace"
# cask "microsoft-office"
# cask "microsoft-teams"
